/***************************************************************************
 *				北京科银京成技术有限公司 版权所有
 * 	 Copyright (C) 2013 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/

/*
 *修改历史:
 *2013-06-27         彭元志，北京科银京成技术有限公司
 *                         创建该文件。
 */

/*
 * @file:taInit.c
 * @brief:
 *             <li>ta模块初始化</li>
 */
 
/************************头 文 件******************************/
#include "ta.h"

/************************宏 定 义********************************/

/************************类型定义*******************************/

/************************外部声明*******************************/

/************************前向声明*******************************/

/************************模块变量*******************************/

/************************全局变量*******************************/

/************************函数实现*******************************/

/*
 * @brief:
 *      TA初始化，上电后第一个C入口
 * @return:
 *      无
 */
void sys_init(void)
{
    /* 打开回显设备 */
    taDisplayDeviceOpen();
		
    /* printk初始化 */
    printkInit(taPrintChar);
    
    /* Arch相关初始化 */
    taArchInit();
 
    /* 桥初始化 */
    taBrigdeInit();
    	
    /* 初始化调试设备 */
    taDebugDeviceInit();
    
    /* 显示启动信息 */
    taDisplayStartedInfo(); 
    
    /* 初始化信息查询模块 */
    taManagerInit();
		
    /* TA调试初始化 */
    taDebugInit();
  
    /* 进入异常处理程序，轮循收包 */    
    taTrap();
}
