/***************************************************************************
 *                北京科银京成技术有限公司 版权所有
 *      Copyright (C) 2013 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/

/*
 *修改历史:
 *2013-08-28         彭元志，北京科银京成技术有限公司
 *                          创建该文件。
 */

/*
 * @file:taskInitLib.c
 * @brief:
 *             <li>任务级调试初始化</li>
 */

/************************头 文 件*****************************/
#include "taRtIfLib.h"
#include "taskSessionLib.h"
#include "taskInitLib.h"
#include "taDebugMode.h"
#include "ta.h"

/************************宏 定 义******************************/

/************************类型定义*****************************/

/************************外部声明*****************************/

/************************前向声明*****************************/

/************************模块变量*****************************/

/************************全局变量*****************************/

/* 运行时接口 */
TA_RT_IF taRtIf;

/************************实   现********************************/

/*
 * @brief:
 *     任务级调试初始化
 * @return:
 *     TA_OK：初始化成功
 */
T_TA_ReturnCode taTaskInitLib(void)
{
	/* 初始化调试会话 */
	taSessionInit();

	/* 运行时接口初始化 */
	taRtLibInit(&taRtIf);

	/* 任务级调试相关接口初始化 */
	taTaskRtIfInit();

	/* 任务HOOK初始化 */
	taTaskHookInit();

    /* 设置当前调试模式为任务级调试模式 */
    taDebugModeSet(DEBUGMODE_TASK);

    /* 控制命令初始化 */
    taCtrlCommandInit();

    /* 设置任务级异常处理函数  */
    _func_taTaskExceptionHandler = taTaskExceptionHandler;

	return TA_OK;
}
