/************************************************************************
 *				北京科银京成技术有限公司 版权所有
 * 	 Copyright (C) 2011 CoreTek Systems Inc. All Rights Reserved.
 ***********************************************************************/

/*
 * 修改历史：
 * 2011-02-23         李燕，北京科银京成技术有限公司
 *                               创建该文件。
 * 2011-04-15	  张勇，北京科银京成技术有限公司
 * 				  整理代码格式、优化代码。
*/

/*
 * @file  mathTypesOld.h
 * @brief
 *         <li>提供数学库类型相关的宏定义<li>
 * @implements： DR.2 
 */

#ifndef _MATHTYPESOLD_H
#define _MATHTYPESOLD_H

/************************头文件********************************/
#ifdef __cplusplus
extern "C" {
#endif

/************************宏定义********************************/
#if defined(__STDC__) || defined(__cplusplus)

#define CHAR_FROM_CONST(x)	((signed char *)(x))

#endif /* __STDC__ */

/************************类型定义******************************/
/************************接口声明******************************/
#ifdef __cplusplus
}
#endif

#endif
