/************************************************************************
 *				北京科银京成技术有限公司 版权所有
 * 	 Copyright (C) 2011 CoreTek Systems Inc. All Rights Reserved.
 ***********************************************************************/

/*
 * 修改历史：
 * 2011-02-23         李燕，北京科银京成技术有限公司
 *                               创建该文件。
 * 2011-04-15	  张勇，北京科银京成技术有限公司
 * 				   增加PDL描述、整理代码格式。
*/

/*
 * @file: bcopy.c
 * @brief:
 *	   <li> 实现字符串模块里的bcopy。</li>
 * @implements: DR.1
 */

/* @<MODULE */ 

/************************头 文 件******************************/

/* @<MOD_HEAD */
#include <string.h>
/* @MOD_HEAD> */

/************************宏 定 义******************************/
/************************类型定义******************************/
/************************外部声明******************************/
/************************前向声明******************************/
/************************模块变量******************************/
/************************全局变量******************************/
/************************实    现******************************/

/* @MODULE> */


/*
 * @brief: 
 *    从源区域拷贝指定长度字节到目的区域。
 * @param[in]: b1: 拷贝源起始地址
 * @param[in]: length: 拷贝长度
 * @param[out]: b2: 拷贝目的起始地址
 * @return: 
 *    无
 * @qualification method: 分析/测试
 * @derived requirement: 否
 * @function location: Internal
 * @tracedREQ: RR.1.1
 * @implements: DR.1.13
 */
void bcopy(const char *b1, char *b2, size_t length)
{
    /* @KEEP_COMMENT: 调用memmove(DR.1.3)从<b1>区域拷贝<length>长度字节到<b2>区域 */
    memmove((void *)b2, (void *)b1, length);

    return;
}

