/***************************************************************************
 *                北京科银京成技术有限公司 版权所有
 *      Copyright (C) 2013 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/

/*
 *修改历史:
 *2013-05-26         彭元志，北京科银京成技术有限公司
 *                           创建该文件。
 */

/**
 * @file  mdlInitLib.c
 * @brief
 *       功能：
 *       <li>动态下载代理初始化</li>
 */

/************************头 文 件******************************/
#include "rseConfig.h"
#include "rseInitLib.h"

/************************宏 定 义******************************/

/************************类型定义*****************************/

/************************外部声明*****************************/

/************************前向声明*****************************/

/************************模块变量*****************************/

/************************全局变量*****************************/

/************************函数实现*****************************/

/*
 * @brief
 *    rse库初始化
 * @return
 *    ERROR：初始化失败
 *    OK：初始化成功
 */
STATUS rseLibInit(void)
{
	/* 动态加载代理模块命令初始化 */
	rseCommandInit();

	/* CPU信息库初始化 */
	rseCpuInfoLibInit();

	/* 核心任务库初始化 */
	rseKernelTaskLibInit();

	/* 模块信息库初始化 */
	rseModuleLibInit();

	/* RTP信息库初始化  */
	//rseRtpLibInit();

	return OK;
}
