/***************************************************************************
 *                北京科银京成技术有限公司 版权所有
 *      Copyright (C) 2013 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/

/*
 *修改历史:
 *2013-05-26         彭元志，北京科银京成技术有限公司
 *                           创建该文件。
 */

/**
 * @file  mdlInitLib.h
 * @brief
 *       功能：
 *       <li>动态下载初始化相关声明</li>
 */
#ifndef MDL_INITLIB_H_
#define MDL_INITLIB_H_

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */
/************************头 文 件******************************/
#include <vxWorks.h>

/************************宏 定 义******************************/

/************************类型定义*****************************/

/************************接口声明*****************************/

/*
 * @brief
 *    动态加载库初始化
 * @return
 *    OK：初始化成功
 */
STATUS mdlLibInit(void);

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* MDL_INITLIB_H_ */
