/***************************************************************************
 *				北京科银京成技术有限公司 版权所有
 * 	 Copyright (C) 2013 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/

/*
 * 修改历史:
 * 2013-11-08         彭元志，北京科银京成技术有限公司
 *                          创建该文件。
 */

/*
 * @file:dbMemProbeLib.c
 * @brief:
 *             <li>该模块提供体系结构相关的内存探测访问接口</li>
 */

/************************头 文 件*****************************/
#include "taTypes.h"

/************************宏 定 义******************************/

/************************类型定义*****************************/

/************************外部声明*****************************/
/**
 * @brief:
 *     内存探测体系结构相关初始化，挂接内存访问非法异常处理函数
 * @param[in]:_func_excBaseHook: 异常HOOK指针，异常产生时操作系统调用该HOOK
 * @return:
 * 	   OK：初始化成功
 */
STATUS taMemArchProbeInit(FUNCPTR *_func_excBaseHook)
{

    return (OK);
}

/*
 * @brief:
 *      内存探测，探测内存是否可读写，如果不可读写将产生总线错误
 * @param[out]:length: 内存访问长度
 * @param[in]:src: 源地址
 * @param[in]:dest: 目的地址
 *      OK：读写内存成功
 *      ERROR：发生非法地址访问异常
 */
STATUS taMemProbeSup(int length, char *src, char* dest)
{
	return (OK);
}

