/***************************************************************************
 *				北京科银京成技术有限公司 版权所有
 * 	 Copyright (C) 2013 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/

/*
 *修改历史:
 *2013-06-27         彭元志，北京科银京成技术有限公司
 *                         创建该文件。
 */

/*
 * @file:taDebugInit.c
 * @brief:
 *             <li>调试初始化实现</li>
 */
/************************头 文 件******************************/
#include "taDirectMemory.h"
#include "dbBreakpoint.h"
#include "sdaMain.h"
#include "db.h"

/************************宏 定 义********************************/

/************************类型定义*******************************/

/************************外部声明*******************************/

/************************前向声明*******************************/

/************************模块变量*******************************/

/************************全局变量*******************************/

/************************函数实现*******************************/

/**
 * @brief:
 * 	   TA基本的调试功能初始化，包含内存访问接口,系统级调试，断点管理
 * @return:
 * 	   无
 */
void taDebugInit(void)
{
    /* 内存访问接口初始化 */
	taDebugInitDirectMemory();

    /* 初始化断点表 */
    taDebugBreakPointInit(CONFIG_DB_BREAK_POINT);
	
    /* 初始化系统级调试 */
    taSDAInit();

    /* 基本调试初始化 */
    taDBInit();
}
