/************************************************************************
 *				北京科银京成技术有限公司 版权所有
 * 	 Copyright (C) 2011 CoreTek Systems Inc. All Rights Reserved.
 ***********************************************************************/

/*
 * 修改历史：
 * 2011-02-23         李燕，北京科银京成技术有限公司
 *                               创建该文件。
 * 2011-04-15	  张勇，北京科银京成技术有限公司
 * 				  整理代码格式。
*/

/*
 * @file： stddef.h
 * @brief：
 *	    <li>提供普通类型的宏定义。</li>
 * @implements： DR
 */

#ifndef _STDDEF_H
#define _STDDEF_H

/************************头文件********************************/
#ifdef __cplusplus
extern "C" {
#endif  /* __cplusplus */

/************************宏定义********************************/
/************************类型定义******************************/
/************************接口声明******************************/

#ifdef __cplusplus
}
#endif  /* __cplusplus */

#endif

