/*
* 更改历史：
* 2004-12-6  董洪涛  北京科银技术有限公司
*                    创建该文件。
* 2004-12-07 唐兴培  北京科银技术有限公司
*                    评审该文件。
*/

/**
* @file  stdafx.h
* @brief
*       功能：
*       <li>标准系统包含文件的包含文件或是经常使用但不常更改的特定于项目的包含文件</li>
*/
#pragma once

/************************头文件********************************/
#define WIN32_LEAN_AND_MEAN		// 从 Windows 头中排除极少使用的资料
#include <stdio.h>
#include <tchar.h>

/************************宏定义********************************/

/************************类型定义******************************/

/************************接口声明******************************/
